# Python - Pandas - Data Frame - Select

In [1]:
import pandas as pd    #python data analysis
import numpy as np     #numeric python
import matplotlib.pyplot as plt
%matplotlib inline

#read from CSV
str_path_data = "..//..//data//"
dt_nba = pd.read_csv(str_path_data + "nba.csv")
dt_nba = dt_nba.dropna(how="all") #remove all row where all data is null
dt_nba.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

In [2]:
#Columns
list(dt_nba)

['Name',
 'Team',
 'Number',
 'Position',
 'Age',
 'Height',
 'Weight',
 'College',
 'Salary']

## Aggregate Information

In [3]:
#GROUP BY : DATA TYPE : COUNT(*)
dt_nba.get_dtype_counts()

float64    4
object     5
dtype: int64

In [4]:
#For each column perform Aggregate function : MAX  : outputs a series
dt_nba.max()

Name             Zaza Pachulia
Team        Washington Wizards
Number                      99
Position                    SG
Age                         40
Height                     7-3
Weight                     307
Salary                 2.5e+07
dtype: object

In [5]:
#For each column perform Aggregate function : Standard Dev : outputs a series
pd.options.display.float_format = '{:.4f}'.format
dt_nba.std()

Number        15.9661
Age            4.4040
Weight        26.3683
Salary   5229237.5989
dtype: float64

In [6]:
#For each column perform Aggregate function : Median : outputs a series
dt_nba.median()  # min / sum

Number        13.0000
Age           26.0000
Weight       220.0000
Salary   2839073.0000
dtype: float64

## Get data via dictionary

In [7]:
# to convert data frames into dictionary creates an array of dictionary
len(dict(dt_nba))  #shows 9 columns

9

In [8]:
#dictionary is key-value pair
#to reference a dictionary : use column name as key
dict(dt_nba)["Name"].head()

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [9]:
dict(dt_nba)["Age"].head()

0   25.0000
1   25.0000
2   27.0000
3   22.0000
4   29.0000
Name: Age, dtype: float64

In [10]:
dict(dt_nba)["Salary"].tail()

452   2239800.0000
453   2433333.0000
454    900000.0000
455   2900000.0000
456    947276.0000
Name: Salary, dtype: float64

## Get data via direct column call - Returns Series

In [11]:
type(dt_nba.Name)

pandas.core.series.Series

In [12]:
dt_nba.Name.head()

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [13]:
dt_nba.Name[:5] #equivalent to head : 5 rows

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [14]:
dt_nba.Age.head()

0   25.0000
1   25.0000
2   27.0000
3   22.0000
4   29.0000
Name: Age, dtype: float64

In [15]:
dt_nba.Salary.tail()

452   2239800.0000
453   2433333.0000
454    900000.0000
455   2900000.0000
456    947276.0000
Name: Salary, dtype: float64

## Get data via "string" column call - Returns Series

In [16]:
type(dt_nba["Name"])

pandas.core.series.Series

In [17]:
dt_nba["Name"].head()

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [18]:
dt_nba["Age"].head()

0   25.0000
1   25.0000
2   27.0000
3   22.0000
4   29.0000
Name: Age, dtype: float64

In [19]:
dt_nba["Salary"].tail()

452   2239800.0000
453   2433333.0000
454    900000.0000
455   2900000.0000
456    947276.0000
Name: Salary, dtype: float64

## Multiple Columns

In [20]:
dt_nba[["Name","Team","Salary"]][:5]

            Name            Team       Salary
0  Avery Bradley  Boston Celtics 7730337.0000
1    Jae Crowder  Boston Celtics 6796117.0000
2   John Holland  Boston Celtics          nan
3    R.J. Hunter  Boston Celtics 1148640.0000
4  Jonas Jerebko  Boston Celtics 5000000.0000

In [21]:
columns_to_select = ["Name","Team","Salary"]
dt_nba[columns_to_select].head()

            Name            Team       Salary
0  Avery Bradley  Boston Celtics 7730337.0000
1    Jae Crowder  Boston Celtics 6796117.0000
2   John Holland  Boston Celtics          nan
3    R.J. Hunter  Boston Celtics 1148640.0000
4  Jonas Jerebko  Boston Celtics 5000000.0000